import { GetPopularStoriesResponse } from "@/lib/types/stories";

export const popularStoriesResponseMock: GetPopularStoriesResponse = {
  status: 200,
  message: 'Successfully found popular stories',
  data: {
    stories: [
      {
        _id: '68498236a100312bea079039',
        img: 'https://ftp.goit.study/img/travel-blog/68498236a100312bea079039.webp',
        title: 'Франція: Лазуровий берег',
        article:
          'Лазуровий берег — це поєднання моря і розкоші. Ми відвідали Ніццу, Канни і Монако, насолоджуючись пляжами і вечірнім життям. Променад дез Англе в Ніцці подарував нам вечірню прогулянку з видом на море. У Каннах ми потрапили на кінофестиваль і відчули атмосферу свята. Це була подорож у світ сонця і середземноморського стилю.',
        category: {
          _id: '68fb50c80ae91338641121f2',
          name: 'Європа',
        },
        ownerId: {
          _id: '6881563901add19ee16fd009',
          name: 'Єва Поліщук',
          avatarUrl:
            'https://ftp.goit.study/img/harmoniq/users/6881563901add19ee16fd009.webp',
        },
        date: '2024-11-01',
        favoriteCount: 29,
      },
      {
        _id: '68498236a100312bea079004',
        img: 'https://ftp.goit.study/img/travel-blog/68498236a100312bea079004.webp',
        title: 'Сицилія: вулкани, міста і смаки',
        article:
          'Сицилія — це поєднання історії, природи і кулінарії. Ми піднімалися на Етну, гуляли вузькими вуличками Таорміни і смакували канолі на місцевих ринках. Кожне місто має свій характер: Палермо з його шумними вулицями, Сіракузи з античними руїнами, Чефалу з мальовничими пляжами. Сицилія відкрилася як острів контрастів, де кожен день приносить нові відкриття.',
        category: {
          _id: '68fb50c80ae91338641121f2',
          name: 'Європа',
        },
        ownerId: {
          _id: '6881563901add19ee16fcffb',
          name: 'Дарина Ковальчук',
          avatarUrl:
            'https://ftp.goit.study/img/harmoniq/users/6881563901add19ee16fcffb.webp',
        },
        date: '2025-03-08',
        favoriteCount: 29,
      },
      {
        _id: '68498236a100312bea07901c',
        img: 'https://ftp.goit.study/img/travel-blog/68498236a100312bea07901c.webp',
        title: 'Марокко: вулиці Марракеша',
        article:
          'Марракеш — це місто кольорів і запахів. Медина з її вузькими вуличками, базари зі спеціями, килимами і ліхтарями створюють атмосферу казки. Ми заблукали серед лавок, де продавці запрошували скуштувати м’ятний чай. Палац Бахія і сади Мажорель додали спокою серед хаосу міста. Вечорами ми спостерігали за виступами музикантів і танцюристів на площі Джема-ель-Фна. Марракеш залишає яскраві враження і бажання повернутися.',
        category: {
          _id: '68fb50c80ae91338641121f4',
          name: 'Африка',
        },
        ownerId: {
          _id: '6881563901add19ee16fd010',
          name: 'Назар Романенко',
          avatarUrl:
            'https://ftp.goit.study/img/harmoniq/users/6881563901add19ee16fd010.webp',
        },
        date: '2024-09-24',
        favoriteCount: 28,
      },
      {
        _id: '68498236a100312bea079040',
        img: 'https://ftp.goit.study/img/travel-blog/68498236a100312bea079040.webp',
        title: 'США: Гранд-Каньйон',
        article:
          'Гранд-Каньйон — це місце, яке змушує відчути масштаб планети. Ми стояли на оглядовому майданчику і милувалися шарами скель, що відкривають історію мільйонів років. Спуск донизу був непростим, але краєвиди зсередини каньйону були ще вражаючішими. Це подорож, яка залишає глибокий слід у пам’яті.',
        category: {
          _id: '68fb50c80ae91338641121f3',
          name: 'Америка',
        },
        ownerId: {
          _id: '6881563901add19ee16fcff5',
          name: 'Дмитро Романенко',
          avatarUrl:
            'https://ftp.goit.study/img/harmoniq/users/6881563901add19ee16fcff5.webp',
        },
        date: '2025-02-01',
        favoriteCount: 27,
      },
    ],
    page: 1,
    perPage: 4,
    totalItems: 94,
    hasNextPage: true,
  },
};